# ReferencePlanesOverconstrained Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ReferencePlanesOverconstrained Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Reference Planes are overconstrained.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReferencePlanesOverconstrained { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferencePlanesOverconstrained As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReferencePlanesOverconstrained {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace